apple-open-source/macos/IOUSBFamily/AppleUSBUHCI/Classes/AppleUSBUHCI_RootHub.cpp
    return kIOReturnSuccess;
}



IOReturn
AppleUSBUHCI::RHCreateInterruptEndpoint(short				endpointNumber,
                                        UInt8				direction,
                                        short				speed,
                                        UInt16				maxPacketSize,
                                        short				pollingRate)
{
    USBLog(3, "%s[%p]::RHCreateInterruptEndpoint rate %d", getName(), this, pollingRate);
    
    _rootHubPollingRate = pollingRate;
    return kIOReturnSuccess;
}



IOReturn
AppleUSBUHCI::RHCreateInterruptTransfer(IOUSBCommand* command)
{
    int 		index;
	AbsoluteTime	lastRootHubChangeTime, currentTime;
	UInt64			elapsedTime = 0;
    
    USBLog(5, "AppleUSBUHCI[%p]::RHCreateInterruptTransfer", this);
    
    if (_rootHubPollingRate == 0) 
	{
		USBLog(2, "AppleUSBUHCI[%p]::RHCreateInterruptTransfer, pollingRate is 0!", this);
        return kIOReturnBadArgument;
    }
    
    IOTakeLock(_intLock);
    
    for (index = 0; index < kMaxOutstandingTrans; index++)
    {
        if (_outstandingTrans[index].completion.action == NULL)
        {
            // found free trans
            _outstandingTrans[index].buf = command->GetBuffer();
            _outstandingTrans[index].bufLen = command->GetReqCount();
            _outstandingTrans[index].completion = command->GetUSLCompletion();
            IOUnlock(_intLock);									// Unlock the queue
			// Calculate how long it's been since the last status change and wait until the pollingRate to call the UIMRootHubStatusChange()
			lastRootHubChangeTime = RHLastPortStatusChanged();
			
			clock_get_uptime( &currentTime );
			SUB_ABSOLUTETIME(&currentTime, &lastRootHubChangeTime );
			absolutetime_to_nanoseconds(currentTime, &elapsedTime);
			elapsedTime /= 1000000;  // convert it to ms
			
			if ( elapsedTime < kUHCIRootHubPollingInterval )
			{
				USBLog(5, "AppleUSBUHCI[%p]::SimulateRootHubInt  Last change was %qd ms ago.  IOSleep'ing for %qd ms",  this, elapsedTime, kUHCIRootHubPollingInterval - elapsedTime );
				IOSleep( kUHCIRootHubPollingInterval - elapsedTime );
			}
			
			// Call and pick up any pending changes and enable the RH timer
			UIMRootHubStatusChange(false);
			
            return kIOReturnSuccess;
        }
    }
	
    IOUnlock(_intLock);														// Unlock the queue
    Complete(command->GetUSLCompletion(), -1, command->GetReqCount());		// too many trans
        
    return kIOReturnSuccess;
}



void
AppleUSBUHCI::RHCheckStatus()
{
    int						i;
    UInt16					status;
    bool					change = false;
        
    /* Read port status registers.
    * Check for resumed ports.
    * If the status changed on either, call the
    * port status changed method.
    */
    for (i=0; i<kUHCI_NUM_PORTS; i++) 
	{
        status = ReadPortStatus(i);
        if (status & kUHCI_PORTSC_RD) 
		{
            USBLog(3, "AppleUSBUHCI[%p]::RHCheckStatus - resume detected on port %d, resuming", this, i+1);
			if ( _idleSuspend )
			{
				USBLog(3, "AppleUSBUHCI[%p]::RHCheckStatus  - restarting bus before resuming port",  this);
				setPowerState(kUHCIPowerLevelRunning, this);
			}
            RHSuspendPort(i+1, false);
            change = true;
        } else if (status & (kUHCI_PORTSC_PEDC|kUHCI_PORTSC_CSC|kUHCI_PORTSC_RD)) 
		{
            USBLog(3,"AppleUSBUHCI[%p]::RHCheckStatus Status changed on port %d", this, i+1);
            change = true;
        } else if (_portWasReset[i]) 
		{
            change = true;
        }
    }
    
    if (change) 
	{
        USBLog(3, "AppleUSBUHCI[%p]::RHCheckStatus - Status change for root hub", this);
        if ( _idleSuspend )
		{
			USBLog(3, "AppleUSBUHCI[%p]::RHCheckStatus - port change detect interrupt while in idlesuspend - restarting bus",  this);
            setPowerState(kUHCIPowerLevelRunning, this);
		}
        UIMRootHubStatusChange(false);
    }    
}



void 
AppleUSBUHCI::RHTimerFired(OSObject *owner, IOTimerEventSource *sender)
{
    AppleUSBUHCI *myself;
    UInt32 period;
    
    myself = OSDynamicCast(AppleUSBUHCI, owner);
	
    if (!myself || myself->isInactive() || !myself->_uhciAvailable)
        return;
    
    myself->RHCheckStatus();

    if (myself->_rootHubPollingRate)
	{
        //USBLog(1, "AppleUSBUHCI[%p]::RHTimerFired - restarting rhTimer(%d)", myself, myself->_rootHubPollingRate);
        myself->_rhTimer->setTimeoutMS(myself->_rootHubPollingRate);
	}
}



void
AppleUSBUHCI::RHEnablePort(int port, bool enable)
{
    UInt16 value;

    // USBLog(5, "%s[%p]::RHEnablePort %d %d", getName(), this, port, enable);
    port--; // convert 1-based to 0-based.
    value = ReadPortStatus(port) & kUHCI_PORTSC_MASK;
    USBLog(3, "%s[%p]::RHEnablePort port: %d enable: %d PortSC: 0x%x", getName(), this, port+1, enable, value);
	USBLog(2, "AppleUSBUHCI[%p]::RHEnablePort  (CMD:%p STS:%p INTR:%p PORTSC1:%p PORTSC2:%p FRBASEADDR:%p FRNUM:%p, SOFMOD:%p, ConfigCMD:%p)", this, (void*)ioRead16(kUHCI_CMD), (void*)ioRead16(kUHCI_STS), (void*)ioRead16(kUHCI_INTR), (void*)ioRead16(kUHCI_PORTSC1), (void*)ioRead16(kUHCI_PORTSC2), (void*)ioRead32(kUHCI_FRBASEADDR),  
		   (void*)ioRead32(kUHCI_FRNUM),  (void*)ioRead32(kUHCI_SOFMOD), (void*)_device->configRead16(kIOPCIConfigCommand));
   if (enable) 
	{
        value |= kUHCI_PORTSC_PED;
    } else 
	{
        value &= ~kUHCI_PORTSC_PED;
    }
    WritePortStatus(port, value);
}



IOReturn
AppleUSBUHCI::RHSuspendPort(int port, bool suspended)
{
    UInt16 cmd, value;
    
    USBLog(3, "AppleUSBUHCI[%p]::RHSuspendPort %d (%s)", this, port, suspended ? "SUSPEND" : "RESUME");
    port--; // convert 1-based to 0-based.

    cmd = ioRead16(kUHCI_CMD);
    value = ReadPortStatus(port) & kUHCI_PORTSC_MASK;
    
    if (suspended) 
	{
        value |= kUHCI_PORTSC_SUSPEND;
        value &= ~kUHCI_PORTSC_RD;
    } else 
	{
        if (cmd & kUHCI_CMD_EGSM) 
		{
            /* Can't un-suspend a port during global suspend. */
            USBError(1, "AppleUSBUHCI[%p]: attempt to resume during global suspend", this);
            return kIOReturnError;
        }
        value |= (kUHCI_PORTSC_SUSPEND | kUHCI_PORTSC_RD);
    }
    /* Always enable the port also. */
    value |= kUHCI_PORTSC_PED;

    USBLog(7, "AppleUSBUHCI[%p]: writing 0x%x to port control", this, value);
    
